; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p3---int100n150-m25---int100c110---s11---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 - fuellevel
)

(:init
(sum level0 level7 level7)
(sum level0 level8 level8)
(sum level0 level17 level17)
(sum level0 level24 level24)
(sum level1 level7 level8)
(sum level1 level8 level9)
(sum level1 level17 level18)
(sum level1 level24 level25)
(sum level2 level7 level9)
(sum level2 level8 level10)
(sum level2 level17 level19)
(sum level2 level24 level26)
(sum level3 level7 level10)
(sum level3 level8 level11)
(sum level3 level17 level20)
(sum level3 level24 level27)
(sum level4 level7 level11)
(sum level4 level8 level12)
(sum level4 level17 level21)
(sum level4 level24 level28)
(sum level5 level7 level12)
(sum level5 level8 level13)
(sum level5 level17 level22)
(sum level5 level24 level29)
(sum level6 level7 level13)
(sum level6 level8 level14)
(sum level6 level17 level23)
(sum level6 level24 level30)
(sum level7 level7 level14)
(sum level7 level8 level15)
(sum level7 level17 level24)
(sum level7 level24 level31)
(sum level8 level7 level15)
(sum level8 level8 level16)
(sum level8 level17 level25)
(sum level8 level24 level32)
(sum level9 level7 level16)
(sum level9 level8 level17)
(sum level9 level17 level26)
(sum level9 level24 level33)
(sum level10 level7 level17)
(sum level10 level8 level18)
(sum level10 level17 level27)
(sum level10 level24 level34)
(sum level11 level7 level18)
(sum level11 level8 level19)
(sum level11 level17 level28)
(sum level11 level24 level35)
(sum level12 level7 level19)
(sum level12 level8 level20)
(sum level12 level17 level29)
(sum level13 level7 level20)
(sum level13 level8 level21)
(sum level13 level17 level30)
(sum level14 level7 level21)
(sum level14 level8 level22)
(sum level14 level17 level31)
(sum level15 level7 level22)
(sum level15 level8 level23)
(sum level15 level17 level32)
(sum level16 level7 level23)
(sum level16 level8 level24)
(sum level16 level17 level33)
(sum level17 level7 level24)
(sum level17 level8 level25)
(sum level17 level17 level34)
(sum level18 level7 level25)
(sum level18 level8 level26)
(sum level18 level17 level35)
(sum level19 level7 level26)
(sum level19 level8 level27)
(sum level20 level7 level27)
(sum level20 level8 level28)
(sum level21 level7 level28)
(sum level21 level8 level29)
(sum level22 level7 level29)
(sum level22 level8 level30)
(sum level23 level7 level30)
(sum level23 level8 level31)
(sum level24 level7 level31)
(sum level24 level8 level32)
(sum level25 level7 level32)
(sum level25 level8 level33)
(sum level26 level7 level33)
(sum level26 level8 level34)
(sum level27 level7 level34)
(sum level27 level8 level35)
(sum level28 level7 level35)

(connected l0 l1)
(fuelcost level17 l0 l1)
(connected l0 l2)
(fuelcost level17 l0 l2)
(connected l0 l3)
(fuelcost level24 l0 l3)
(connected l1 l0)
(fuelcost level17 l1 l0)
(connected l1 l2)
(fuelcost level24 l1 l2)
(connected l1 l3)
(fuelcost level7 l1 l3)
(connected l2 l0)
(fuelcost level17 l2 l0)
(connected l2 l1)
(fuelcost level24 l2 l1)
(connected l2 l3)
(fuelcost level8 l2 l3)
(connected l3 l0)
(fuelcost level24 l3 l0)
(connected l3 l1)
(fuelcost level7 l3 l1)
(connected l3 l2)
(fuelcost level8 l3 l2)

(at t0 l0)
(fuel t0 level35)
(= (total-cost) 0)

(at p0 l2)
(at p1 l2)
(at p2 l3)
)

(:goal
(and
(at p0 l3)
(at p1 l1)
(at p2 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l0 l2 level18 level17 level35)
   deleted: (at t0 l0) (fuel t0 level35)
   added: (at t0 l2) (fuel t0 level18)
   goals met: 0 of 3
2. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 0 of 3
3. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 3
4. (drive t0 l2 l3 level10 level8 level18)
   deleted: (at t0 l2) (fuel t0 level18)
   added: (at t0 l3) (fuel t0 level10)
   goals met: 0 of 3
5. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 0 of 3
6. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 1 of 3
7. (drive t0 l3 l1 level3 level7 level10)
   deleted: (at t0 l3) (fuel t0 level10)
   added: (at t0 l1) (fuel t0 level3)
   goals met: 1 of 3
8. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 2 of 3
9. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 3 of 3
